["Ok, what can I say but the Saucer is slowly winning me over!  Maybe it's because I've been in a very, beery mood (St Paddy's week?) but my last visit with Michael E was sorta fun.  Nice spring evening, good brews and a picnic table makes me happy!  I ordered up the rocket tots which had a nice bite with the jalapeno bits embedded inside along with two great, fresh baked pretzels, uhmm!  The pretzels came with some sinus-clearing mustard and some queso, a perfect complement to the beer.  

And oh yeah the service!  Not bad at all although we didn't get one of the plaid-skirted lassies.  Service at the bar was quite good too. It was difficult scoring a table after 6pm given it was Brewery Night.  We got a ticket for a free Highland Gaelic Ale and glass on the way in, score!  Overall, yes I still wouldn't come here too often because it's just not really my scene.  But I'd certainly recommend it to anyone looking for great brews and supa-fly waitstaff clad in knee-hi's...", "****** -- YUP! SIX STARS.

I AM A BEER LOVER! 
And nothing is more impressive than having over 200 beers to select from. 
Mondays is Pint Night which means $3. Trivia Tuesdays too! 

It's on a corner but don't be fooled this place unfolds as you walk in. 
They have plaques on the walls from UFO members whom have courageously made it to 200 tastings of beers here. Can I get a woot? 

Challenge accepted! I signed up right away, received my cool UFO member card on the spot with a BeerKnurd shirt and calender. (adjusts glasses) Cool dude!
But don't get ballsy my friends, you only get credit for 3 beers each visit. Which means, you can drink all you want after that except you still need to come back. ;) 

Oh, and they also provide free brunch for the members on Sunday which is dope. 
I tried the cheesy tots which were great with the side dip! 

Do try:
Big Boss Bad Penny
Lonerider Shotgun Betty
Magic Hat No.9
Wells Banana Bread

Cheers!", "This is a good place to go out for drinks in downtown Raleigh.  Their food has been getting better, according to friends, but I tend to stick with getting some of the share plates or the Hippie Hollow because I know those are good.

At Saucers, I prefer to sit outside when the weather's nice.  It gets too noisy indoors for me - when I went with a table of four and we were inside, the two people opposite each other had to yell to be heard.  Each time I've been outside, though, it's very chill and super friendly.  Plus, people like to bring their dogs here so it's easy to strike up a conversation with the strangers sitting next to you - just talk about the nearby dog.

Seating can get rare so don't be surprised when people start hovering around you, trying to take your seat as soon as you leave.", "There is really nothing that I can say that would be different from the other reviews. However, I guess since I'm a big fan of Belgian Ales, I can make a few recommendations. For a cheaper option, I like the Palm. For a mid-range, I like Duvel, which I'm glad they have. Malheur is another favorite, but it's rather different. 

The food: The rocket tots are super delicious. None of my friends have said bad things about it and at least one of them gets it every time we go there. Another thing that I'm a huge fan of is the farmer's pick. The salami and the cheese is great, and it's served with a nice big basket of crackers. The pick 5 is definitely going to keep you full and satisfied through a few rounds of trivia and the pick 3, in my opinion, is enough. The sex trivia on Tuesday nights at 9pm is fun and cool. The service is always great, though slow on busy nights.

On top of that, their wings are super tender, and moist, and the dry rub is a nice change from the tons of sauce that wings are usually drenched in. It was actually sufficiently spicy without being too much so, and it's pretty satisfying. It's probably the best wings I've had so far in the triangle. If there is better, I'd be super excited for them. Anyone that comes to Raleigh from out-of-town really needs to come to Flying Saucer for a good night.", "I have visited The Flying Saucer a handful of times since it opened. I am not a regular, but go maybe once or twice a year. Like the other reviews have noted, the saucer is always packed! I don't think I have ever been there when all of the tables weren't occupied.  It is a great place for beer lovers (one of the best selections in the Triangle). I usually stick to domestics, but I have found that I really like the Alagash White beer here, and I have ventured out and tried a few others too.

The food here is just ok. Not really a foodie type place, but more of your typical bar food. I have had their beer cheese soup, and a few sandwiches.  The beer cheese soup was spicy and came in a bread bowl. A good choice on a cold Winter night! The food is designed to go well with beer, so the options suffice for that. The barmaids have always been helpful and efficient during my visits, and yes they do wear skimpy outfits!

Though the Flying Saucer does have a few t.v's, this is not really a sports bar, more of a hang out with friends and consumer beer kind of a place. It can get pretty loud when full, and as I mentioned earlier it is always full.

So in conclusion I don't think The Flying Saucer will ever be a regular haunt for me. I am just not that big of a craft beer fan. Not really interested in the whole UFO club thing. It is a good chill place to hang out and drink beer and shoot the shit with friends though, so if you are a big beer fan, by all means you should be hanging out here!", "The Saucer is always a great treat, especially on MONDAY NIGHTS!!!  You can not beat the selection of beers on tap.  Monday nights to those who do not know are pint nights, selected pints are $3.  Their food is a bit better than the average bar food.  I've come here and always gotten good service. Their pretzels are def a worthy mention, especially with their dipping sauces.  I've had the individual pizza by the slice, it's decent. If you are going on a Monday night, gotta get there earlier for any hopes of a table.

Of course I must mention the males favorite part:  hot waitress with their plaid mini skirts!", "So, first of all, I don't drink much beer unless it's a lambic or some other weird thing. If you love beer, that will probably override many of my star-docking points because their beer menu is crazy extensive, so keep that in mind. The one point you *may* care about is this: we go to trivia here just about every week, so I have been here going on ten times, and it is a frequent occurrence that my boyfriend orders something and is told they are out of it (this has happened for tap and bottle both). His tastes are a little eclectic, so if you're REALLY looking to branch out with your brew, just a brief caution.

The food and drink I have had here would probably be 4 stars, but the service is VERY inconsistent. Some of the waitresses are great and attentive; with others, I've had to wait 20 minutes to locate them to ask for the check. I was putting off this review waiting for it to level off one way or the other and it just hasn't, so I'm cutting my losses. Maybe they're nicer to tables with all guys hoping for the better tip (we're usually an even gender split); I don't really know.", "Plenty of reviews and most cover the gist of the place. With that noted I'll keep my review relatively short. The first thing you may notice when walking into the establishment are the amount of saucers flying around on the wall. Kidding. They are tacked onto the wall. If you're one of the lucky few who have finished/tasted their 200+ beer selection, you get a spot on the wall with your name engraved into the saucer. Pretty neat. All it costs is $18 to get started with your UFO card and you're all set to keep the tabs coming. The adventurous may get a kick out of it. The picky beer sticklers, not so much. 

The place is deceivingly large. You're flanked by outside seating w/ heaters on during the winter, a wide selections of 4-tops to bench seating in the middle and then a cozy couch enclave in the front. Regulars (I know). The place is big enough to where you can stand and walk around without spilling your beer on the unwelcoming person below. A must for me. You won't feel claustrophobic and ambient lighting that sets the Friday night moods. 

Service is excellent. I've never received bad service and just the other night the waitress had an accident and the manager comped her drinks without hesitation. They aim to please and keep you coming back. Food here is sub-par at the best. Overpriced and inconsistent. I would stick with the pizzas and maybe their bratwurst combo, but nothing else. Stay away from the wings. You'll be upset and won't even remember eating them. And that isn't caused from the beer, mind you. 

Their beer selection is quite hefty. Coming from a town that had several "beer lovers" restaurants and bars, I could appreciate the selection. Then again, this place is a chain, so you won't find anything out of ordinary. 

Why come here then? Service and atmosphere. It has a warm feeling to it when you're with the right company. There aren't kids here. At least the times that I have went. They card early and keep out the underagers. Much appreciated. I enjoy coming here. It has the right feel and price (beer wise) and doesn't feel like a place where people are looking for love, if you know what I mean.", "So I came here because I heard this place is fantastic. It was OK. I had the hummus and pita appetizer and that was really good. It has a spicy kick to it. I also tried a beer.. don't even know what it was.. so many to choose from.

I did come alone and it may be more fun when you come with company.", "Let me get a beer (or 300).  Been going here since I could drink when I was 20.  ha.  Waiters are somewhat knowledgable.  But their skirts typically do all the talking for me.

I will continue going here until I leave Raleigh, which isn't going to happen.", "Had an AMAZING experience, cheap flights and great beer.", "I wanted to like this place more than I did but given how many taps they had going, they didn't serve Triangle Brewery beers.  The food was very average and nothing I would go back for, also not a lot of vegetarian items that appealed to me so I had to settle for a salad.

I don't mind bar atmospheres but getting interrupted by a loud bell announcing someone's entry into the sh!tfaced hall of fame was kind of jolting. The tables and benches were uncomfortable and bolted down so you couldn't adjust how close you were to the table so I kept eating from my lap.  It was definitely loud and buzzing.  There is an option to sit outside but smoking is permitted so depends who your patio mates are I guess.  

The waitstaff is friendly but how many short skirt establishments do we need?", "Went there the first time and were treated with respect and our business appreciated.  Went there the second time and it was like Hooters at a brew pub.  Screaming babies, inconsiderate bar tenders and skimpy wings.  The wings were great but only 8 pieces (4 wings) for a hefty price.

I'll frequent local brew pubs, this chain doesn't get it!", "Great beer, attractive barmaids and clean bathrooms.", "After the first time I went here, it would have been a rating of three. But it's slowly edged its way up...

This place can get LOUD. Almost to the point of "club" loud, where you have to shout at your friends just to be heard. 

The food is decent, though they have a TERRIBLE selection. This really isn't a good place to come for a meal, though you could do it. Just a handful of different options, most of which are geared to a very specific taste (mostly German).

The beer, though, is great. Great selection. In general, the don't have the coolest of beers, but they have a lot of local options and some pretty good brews to try from a pretty diverse set of styles. And becoming a Beer Knurd is pretty cool...

Service is decent. Much better when its less busy, but still pretty good all around. The waitresses do know their beer, which is always a plus.

And, you're allowed to bring your dogs on the porch, which is a hell of a lot of fun. And if the dogs are awesome, they'll even bring them a dish of water.", "I'd come to the realization that despite being a very frequent visitor to the RDU area over the last 13 years, that I could find my way around anywhere on the outskirts of town like the back of my hand, but aside from the streets I ran on during several years of the Krispy Kreme Run, I really didn't know Downtown Raleigh, like at all.

I spent a Friday evening wandering around Downtown, and eventually I came across this establishment where it appeared there were many jovial, inebriated folks drinking their nights away on a comfortable looking patio.  And then I saw several long-legged waitresses running around in sinfully short skirts, and that's when I was like "f this, time to go have some drinks."  Yes, I have little fear of being the pitiful solitary soul who wanders haphazardly into bars on his own.

It didn't take but a few seconds before the pretty bartender found me at the bar and informed me of the $3 special, and the drinking began.  As the satisfying feeling of drinking cold beer washed over me, I took a minute to survey the environment; dark, wood-like decor, and plates, or saucers all over the ceiling, walls and the bar.  There were like over 50 taps on the wall, but I wasn't sure if they were all unique, or if they began to repeat at some point.  Didn't matter to me, really.  It was surprisingly dead for a Friday night, but from what I was told is that this place gets stupid crowded when it's not as late.

I brought my friends the following night, selling them on the fact that it's a place where they have 50 taps, and waitresses in stupidly short skirts, and wasn't far from where our hotel was, and we had a good time.  That's really all I can say, because I remember ordering and eating food, but I was so obliterated, that I can't remember if it was truly good or not.  But it stayed down, so I have to imagine it was good enough.  One of my friends passed out and vanished to the men's room, and my party didn't see him or his girlfriend for the rest of the night; eventually our sexy short-skirted waitress let us know that they called a cab for him, and they went back to the hotel.  I said okay, fine, as I drank the rest of both of their abandoned beers, and enjoyed the rest of my evening there.

It's a shame there isn't one of these in Atlanta.  I would be a member of the UFO club so fast that something-something-Talladega Nights reference.  Would gladly, and plan to, visit again the next time I'm out in Raleigh.", "Awesomeness.

Great vibe here. Food just so-so. Service is very good.

I wish they offered more NC beers.", "As an out of town visitor, I was pleasantly surprised to learn that Raleigh is a beer town.  Nearly every restaurant and bar has a solid selection of good beer available, including many local options.  But as far as I can tell, the Flying Saucer has the deepest selection of taps and bottles in town.  And what a selection!  Everything from local crafts to Belgian sours is well represented.  

I stopped in for lunch and sat at the bar.  I was promptly greeted and informed of the daily $3 tap special: Belhaven Scottish Stout.  Yes please.  I also enjoyed my roast beef sandwich, which was served warm on a fresh crusty roll with stout-infused au jus for dipping along with addictive and perfectly crisp, seasoned french fries.

Service was very friendly.  My bartender knew the beers on offer, and was also willing to give some advice about local attractions and things to do.  Go here.", "This is a great place to get together with some friends and have some beers. The decor is interesting and it's always bustling. I like stopping in and trying something new on tap. For a bar it's really like 4 stars but for a restaurant it's two which is why I have met int the middile witht the three star rating. I don't recommend getting anything to eat here unless it's straight up fried bar food.

We stopped in for a friend's birthday and I thoroughly enjoyed several drafts before our dinner. For dinner I ordered the goat cheese salad which I did not enjoy. The dressing was really peppery and the greens were a bit wilted and had a somewhat bitter taste to them. I ended up having a liquid dinner that night :) 

Moral of the story; Beer is good and food is meh", "The Flying Saucer seriously wowed me Tuesday night. I arrived ahead of a pretty large group-- around 15 people--and the staff immediately helped me set up a few tables to accomodate us. They even offered us a private room in the back, but we declined so we could participate in the trivia. Ashley, our waitress, was amazing-- handled our entire table effortlessly, and never mixed up orders or checks. 

Obviously the beer selection here is hard to beat, and there's food to match. We split some hot, soft pretzels-- soooo delicious, rocket-tots (tater tots stuffed with cheese and jalepeno peppers/my new favorite food) and I had a turkey melt, with avocado and fresh tomatoes. Seriously unexpected from a place known for its beer. The furniture is also really nice for a bar, lots of seating room with a huge outdoor patio. I loved looking at all of the plates of members who have achieved the 200 beer mark, which have been placed around the walls and ceilings--hilarious quotes!

As for the trivia-- it was a good balance of hard and fun (with a seriously odd focus on Norse Gods). My favorite thing was that they projected the question onto a big screen so you don't have to strain to hear the MC.", "COOL PLACE.. Went here in the summer and the place was jammed packed. Loved that there was outside seating. As for the beer. Well there is way to many on tap to find your favorite one. I got one suggest at this place start from the tap at the very left and work your way right. lol", "Flying Saucer has been a favorite in my group of friends for almost 2 years.  There is quite a selection of beer as well as cider.  Even my friend who doesn't enjoy beer can find a drink here.  Monday pint night is a great deal though can become very busy on this night.  

Another plus to the Saucer is the food.  Everything I have had here has been great.  The best thing on the menu however are the soft pretzels.  They come out warm and soft.  I recommend getting the queso as your dipping sauce.  It's the perfect combination.  Beware of the mustard.  If you like spicy it's for you.  The first time I tried it it burned up my sinuses!  I often like to get a side salad with the pretzels.  This is always fresh and delicious and their dressings are great.  The balsamic vinaigrette is thick and tangy and they also have a jalapeno vinaigrette which is a little spicy but also delicious.  

The patio is a great place to hang out with friends.  Monday nights are hard to find a table due to pint night but other nights you can usually find a table outside.  Their patio is dog friendly and they supply a bowl for water.  My dogs love coming here!  We often come after a run on Tuesday.", ""I know this sounds crazy, but ever since yesterday on the road, I've been seeing this shape. Shaving cream, pillows... Dammit! I know this. I know what this is! This means something. This is important!" - "Close Encounter of the Third Kind," 1977

If you have never been and step into Flying Saucer for the first time, looking around from wall to wall, you will think this is a China shop that serve beers and pretzels. All the plates and saucers in here are immortalized UFO club members that made the magical number of 200 into the ring of honor. Someday I'll get mine too.

Flying Saucer Raleigh just celebrated its 12th Anniversary last Saturday (Mar-5) and to kick things into high gear it partnered with some of the major brewing craftsman around the regions like Big Boss, Lonerider, Foothills, Duck Rabbit, Terrapin, Sierra Nevada Brewing, Ska Brewing, Southern Tier, Great Divide, and Uinta, to cask some of their signature brews into Heaven Hill Bourbon barrels. A new barrel is tapped each hour starting from Noon, and I got to tasted some very special brews you just can't find elsewhere.

As always, Flying Saucer is packed full of people, full of energy. Annie and I was sharing a table with three guys from out of town, who insisted I have to share their birthday shots, which was Wild Turkey in one hand, Jäger bomb in the other. Can you have an unforgettable night if you cannot remember the next morning?!", "You really cant go wrong with a beer menu this size.

I tried one of the flights and it was a lot of fun, good beer, and at abour $8, a good way for an inexperienced beer drinker to figure out what they like.

I shared the hungry farmer with another person. Great combo of meats, cheeses, fruit, bread, and the like. All really quality stuff. Definitely a nice alternative to typical bar food.", "Drinks are good, fast service, awesome selection of beers (duh).

Only BAD point is parking lot security -- yes, it's been about a year since I've been here, but my past experience left a bad taste in my mouth.

A year ago, I was meeting up with a group of friends -- and I was parking in the lot right across from Flying Saucer. I roll into a parking space and notice a middle-aged homeless man hanging out in the lot. He starts walking over to my car (my doors are locked), and then stands right outside my driver's side window, motioning for money. I shake my head and mouth "no", but he is aggressively persistent. Freaking out, I dial my friend inside and she comes out. She approaches my car and tells the homeless man to go away -- he backs off a little, BUT won't take "no" for an answer. I manage to FINALLY get out of my car, and walk over to deposit money for my space -- and the man comes back up, yelling at us for money. My friend starts yelling back at him to leave us alone, and he proceeds to start yelling expletives as he walks away. 

We quickly went inside, but my friend and I were pretty upset about the whole situation. I definitely asked one of my other friends to escort me back out to my car when I left.

Not sure if area security has increased, but this has not been my first time dealing with aggressive homeless people in downtown Raleigh.", "Beer Selection= 5 stars
Food = 2/3 stars

As a huge beer geek this place is right up my alley. Behind the bar, a full wall is devoted to beers of draft and specialty bottles are also offered. My only complaint is that their seasonal beer selection is not stellar and they tend to run out of the rare beers pretty quickly. 

The beer goddesses (waitresses) are super friendly and knowledgeable about their beers. I know that they're required to study and know them really well and this is obvious in their ability to recommend different brews. The patio is an awesome place for a warm day and dog-friendly as well. Their UFO club is an awesome way to track what you've drank and it offers a chance to get your own saucer and some other sweet stuff. 

My only complaint about this place is the food. Although their cheese fries are delicious, I've found the majority of their food to be way too salty for my liking. Luckily, the beer selection is so fabulous I'm content to just drink here.", "Now this joint is a great place for as they say "The Beerknurd" me and friends decided to have our "Save water drink Vodka" monthly campaign gathering here lol pretty huge draught selection its like a selection of over 200 different beers.The wait staff which puts me in the mind of a hooters is comprised of attractive college-age females in short plaid skirts, -- at least one of them is knowledgeable about beers Lol.  

The food is solid and fairly decent although insanely overpriced  I got like 8 wings for $8 and we're not talking Quaker steak here, I also tryed the brat-pretzel with the goat cheese pizza, was actually really good.  Flying Saucer + good drinks + good friends  = good times :) 

Dos equis stay thirsty my friends

P.S  Be sure to bring a designated driver", "What an awesome place...

Almost any day of the week but ESPECIALLY on SUNDAY AND MONDAY! Sunday - $3 NC Pints, and a FREE Brunch buffet for UFO Club Members. I had no idea about that until I visited on a Sunday and tried it. So, it's not a brunch like some of the other places in downtown Raleigh, but it will fill you up and it's FREE!

Monday - is Pint Night...it's a great, great place to meet friends and have a couple of GREAT beers for $3 each. 

Those are my two favorite nights at The Saucer, BUT any day is good.

The waitresses are great, and the food is really terrific! I have had a salmon wrap, the pretzels (Two GIANT WARM and SOFT pretzels) yuuummmmm and I have enjoyed chicken fingers. Great, great food! Cheers!!", "If you are on Yelp, checking out if you should go to the flying saucer tonight, here are a few questions you should be answering for yourself?

Do you love beer? 
Do you love girls in almost-illegal short skirts?
Do you love mediocre beer foods?
Do you love benched outdoor seating?

If you said yes to at least 3 of the 4 questions, then you should go to the flying saucer. 

They have hundreds of different beers available and being someone who does not like beer and shudders at the slightest bitterness, I had a good time. I ordered mostly lambics and the prices were very reasonable. $4 to 5 for a big pint of beer? YES PLEASE!

The food was okay. We had the brat plate and chips and queso. It weren't the best brats I've ever had, but it was tasty. It came with hot potato salad and sauerkraut. The hot potato salad was a little sour, so be warned. I love sour things, so it suit my taste. The brats were crispy on the outside, so it was well mad. There were two different "flavours", but I couldn't taste the different. One was white and one was brown, maybe my tastebuds weren't working. 

The service was good while we got service - we had to wait a long time for our waitress to come back and forth. I think she got drunk while we were there - it was weird. Or she just realized that she REALLLLY loved her job after taking our first order and loved to smile big (almost too big). 

Overall, not a bad place to hang. I can see why this place is so popular.", "I give this place 3 stars for one reason: BEER SELECTION. I envy it. They definitely have the most on tap anywhere in the vicinity. An enormous selection of beers. Some at good prices, others a little bit too marked up. 

Otherwise, the service is lacking...mostly due to the popularity of the place (Fridays and Saturday nights are PACKED - expect it and you won't have a problem). I've gone on a slower night once and the service was much better. The outdoor seating is decent (wooden picnic tables - nothing fancy), but can get a bit dirty throughout the night (beers spilling, cigarette ashes, etc). 

Overall: Go for the beer selection, but that's about it.", "I am probably a little bit biased here, but this is one of my top favorite bars in Raleigh. My husband and I are both "beerknurds" and go to Flying Saucer almost every Monday night for pint night. They have one of the best selections of beers in Raleigh and the prices are very reasonable, especially on Mondays when many of the pints are $3. I have discovered many of my favorite beers here just through trying many of them on the menu, and it is always a fun place to try some new ones.

The food here is pretty good for bar food, I will usually get a sandwich if I'm eating here but the pizzas look pretty good too. My husband and I have started getting a pretzel on most Mondays with our beers and they are really good with the queso and spicy mustard (although the mustard is REALLY spicy!)

We've been a few times for the Sunday brunch. For those in the club, it's a good deal, because it's free (although you have to spend $5 on beer). I'm not sure I would go if I wasn't in the club, because then you'd have to pay for the brunch and the food at the brunch is nothing spectacular.

The outdoor patio is really nice in the warm months. It can get crowded on Mondays and weekend nights and it is common to have to wait for a table, but I've rarely had to wait more than 15-20 minutes to find one.

The waitresses can vary: there are a few that remember us from coming so many times who are very good, but there are a few here (probably new) that can take quite awhile to come take your order or bring you a new beer. We've waited around 30 minutes after finishing our drinks for our checks or second beers a few times depending on our waitress.

Overall I definitely recommend Flying Saucer to anyone who likes beer and trying new beers. It's a fun spot.", "Trivia Fun and The Kingdom of Beer 

Visits: Once in a while
R-Line Stop: R8

Looking for some entertainment on a Tuesday night? Well, check out Trivia Night at The Saucer. There are two contests: one at 7 pm and another at 9 pm. BTW, the 9 pm trivia tends to be more 'adult' oriented (when minors are no longer permitted in the bar). If your team members are true trivia whizzes, then you may win and The Saucer rewards you with a gift certificate to buy more beer! Yeah! My team didn't win last night but we have in the past and we surely enjoyed the free beer on our following visit.

Have you seen the plates on the wall? Do you want one with your name on it? Then join the UFO club. When you drink 200 different beers, then you will have earned your very own plate.

I'm not a beer aficionado but I enjoy a dark brew once in a while. I have tons of choices at The Saucer. The beer menu is organized by beer styles making it easy for me to find the stouts and porters. They have about 80 beers on tap and about another 100 by the bottle. So there is always something new and yummy for me to try.  In case you are a celiac, they actually offer 3 beers that are gluten free and for the DD in your group, there are a few nonalcoholic beers and root beer too.

Last year, the Saucer renovated their outdoor patio. It was good before but now it is awesome. It's a great place to relax and share a beer with friends. Your four legged friends are welcome too.", "This is my favorite establishment in the city!  I am a beer lover and a UFO club member.  The goal to taste 200 different beers has enlightened my taste buds to no end and every visit is a new adventure.  Furthermore, the food is great and the waitresses are gorgeous!  Every trip I make to Raleigh always includes at least one stop to the Flying Saucer- even If i go to other clubs and bars later in the evening, the night always begins here.", "Slow bar service. Not near as nice as the Charlotte Saucer. Food service was quick though. 

It took the bartender about 10-15minutes to even acknowledge me and I was waving around my hands trying to get some attention. 

They were kind of rude when I asked what the specials were and if there was anything new. The only reason I asked was because I couldn't see the boards from where I was sitting. Heaven help you if you are newbie and don't know where to start. Parking blows.", "The quesadillas were probably the best I've ever had. Just sayin'. 

All my friends were feeling adventurous and ordered beer flights ($8.50). Call me a plain jane, but I was perfectly happy with my pint of Blue Moon ($4.50). 

Really loud in here on a Saturday night. Definitely a beer bar. Definitely lots of craziness going on around us. Definitely intrigued by all the saucer plates on the wall. Definitely super casual. Definitely a fun spot.

They have a dyson airblade hand dryer in the bathroom. CHYEAH. Love those things.", "Loved this place and the beer selection is awesome.  Removing one star though because I think the wait staff should be able to wear warm pants when it's cold and they're working outside on the patio.  Seriously, making women wear skirts when the guys are wearing pants?  Come on people this is not 1900.", "There's not much I can add to what's already been said here (holy reviews, Yelpers!) except to say that simply, Flying Saucer is pretty much the perfect bar, unless you're the kind of person who wants to sit in relative quiet staring at a TV while you drink your beer (and I'm not. I mean seriously, just stay home then). 

I love nearly everything about this place. I love the huge, varied selection of beers. I love the entertainment of watching the "schoolgirl" waitresses, and reading the quotes UFO members have selected for their plates. I love the incentive to try new things the UFO club provides. I love the fact that my Beervana shirt, which I have loved since I got it 2 years ago, didn't shrink the first time I put it through the wash! 

The only thing I can say negatively about this place is that some of the food is not impressive. The sandwiches just fail to please sometimes, usually because the lettuce is limp or some other trivial reason. Also, their wings are pretty bad, but I am very picky about my chicken wings! I would say they should offer more wing flavors but their wings are really kind of gross so why bother. 

The Sunday morning buffets, however- GREAT hangover remedy. Especially if you left your car downtown the night before and have to retrieve it anyway. 

I'll see you all at my Saucer unveiling ceremony! Cheers!", "I keep coming back to the Flying Saucer because their beer selection is the best around. Seriously phenomenal, with something for everyone. They don't always have every beer that's listed on their menu, which is frustrating, but with so many options, you can always pick something else you'll love. The beer flights are a great value if you can't make up your mind.

The environment is great as well. I love the outdoor seating (with covering, so you can be out there even if it's raining). I was a little put off by the skimpy waitress attire at first, but every waitress I've had has been, knowledgeable, attentive, and friendly. 

The food goes slightly beyond standard bar fare in variety, but they quality isn't amazing. It's enough to munch on while you're drinking, but I wouldn't recommend it as a lunch spot or anything.

This is a great place to go out after work or on a casual night. And with an ever-changing beer menu, you'll never get tired of the selection.", "During my last road trip to NC, I hit this spot up.  Actually, I always hit this spot up when I'm in Raleigh.

If you like...wait, if you love beer, this spot is for you, F'n tons of options

If you like eating greasy bar food next to a fat southerner (who makes you feel skinny), this spot is for you

If you like talking to random locals that exhibit southern hospitality, this spot is for you

If you like waitresses in Catholic school girl skirts, this spot is for you 

If you like showing off that you reside in the northeast and work for a gi-normous ny corporation to a college chick working on her PhD in Genetic Engineering from UNC or Duke, ...you get it....

I'm prepping the family truckster as I type.", "Holy St Paulie Girl! I have died and gone to beer heaven. 

Good atmosphere with leather seating, huge bar, lots of space, plenty of large flat screens to watch NCAA basketball...CHECK 

Lack of stereotypical sports bar meatheads...CHECK 

Menu of well over 200 beers...CHECK!!!!! 

Hot waitresses wearing VERY short plaid pleated skirts...CHECK and DOUBLE CHECK 

Wow... we celebrated my college roommate's 30th birthday here this past weekend and I hands down consider this the very best beer venue I've been to in my life. 

The beers range from common pedestrian choices like Blue Moon and Samuel Adams to exotics where a 22 oz costs $40.00! Nearly every state and every beer making country has representative selections. I was impressed at the number of Stone Brewing Co selections they had. 

Interestingly, the vast majority of choices were not draught...though this didn't really matter. Overall the average price was about $5 per brew. 

We indulged and then indulged more... over the course of the night I personally drank 9 beers... (at least that I remember counting). 

Flying Saucer ushered me into what will go down as one of my life's top 5 hangovers."]